### One Hot encoding

In [1]:
import pandas as pd

In [22]:
df = pd.read_csv('tested.csv',usecols=['Sex'])

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
df.head()

      Sex
0    male
1  female
2    male
3    male
4  female

In [25]:
pd.get_dummies(df['Sex'], dtype=int)

     female  male
0         0     1
1         1     0
2         0     1
3         0     1
4         1     0
..      ...   ...
413       0     1
414       1     0
415       0     1
416       0     1
417       0     1

[418 rows x 2 columns]

In [27]:
df = pd.read_csv('tested.csv',usecols=['Embarked'])

In [28]:
df.head()

  Embarked
0        Q
1        S
2        Q
3        S
4        S

In [29]:
df.Embarked.unique()

array(['Q', 'S', 'C'], dtype=object)

In [32]:
pd.get_dummies(df['Embarked'], dtype=int).head()

   C  Q  S
0  0  1  0
1  0  0  1
2  0  1  0
3  0  0  1
4  0  0  1

In [34]:
df=pd.read_csv('mercedesbenz.csv',usecols=["X0","X1","X2","X3","X4","X5","X6"])
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [38]:
df.columns

Index(['X0', 'X1', 'X2', 'X3', 'X4', 'X5', 'X6'], dtype='object')

In [37]:
for i in df.columns:
    print(len(df[i].unique()))

47
27
44
7
4
29
12

In [39]:
df.X1.value_counts().sort_values(ascending=False).head(10)

X1
aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: count, dtype: int64

In [40]:
lst_10=df.X1.value_counts().sort_values(ascending=False).head(10).index
lst_10=list(lst_10)

In [41]:
lst_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [42]:
import numpy as np
for categories in lst_10:
    df[categories]=np.where(df['X1']==categories,1,0)

In [43]:
lst_10.append('X1')

In [45]:
df[lst_10].head()

   aa  s  b  l  v  r  i  a  c  o X1
0   0  0  0  0  1  0  0  0  0  0  v
1   0  0  0  0  0  0  0  0  0  0  t
2   0  0  0  0  0  0  0  0  0  0  w
3   0  0  0  0  0  0  0  0  0  0  t
4   0  0  0  0  1  0  0  0  0  0  v